app/controllers/tasks_controller.rb

UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Test Title"], ["updated_at", "2017-05-21 20:32:33.177345"], ["id", 1]]
---
  def update
    @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 100]]
---
  def destroy
    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 100], ["LIMIT", 1]]
---
  def set_task
    @task = Task.find(params[:id])